//Кизеров Евгений, Шевченко Андрей 363
//не успели
package main

import ("fmt"; "math/rand")

func jokes() string {
	jokesMap := make(map[int]string) 
	jokesMap[0] = "Сторож склада бижутерии живет очень бедно, но очень красиво."
	jokesMap[1] = "Неприятность у монгольских авиалиний - лошади, разгоняющие самолет, бастуют."
	jokesMap[2] = "Штирлиц играл в карты и проигрался. Но Штирлиц умел делать хорошую мину при плохой игре. Когда Штирлиц покинул компанию, мина сработала."
	jokesMap[3] = "Штирлиц и Мюллер ездили по очереди на танке. Очередь редела, но не расходилась..."
	jokesMap[4] = "Штирлиц стрелял вслепую. Слепая испугалась и побежала скачками, но качки быстро отстали."
	jokesMap[5] = "Штирлиц шёл по улице, когда внезапно перед ним что-то упало. Штирлиц поднял глаза — это были глаза профессора Плейшнера."
	jokesMap[6] = "Штирлиц упал с балкона и чудом зацепился за другой балкон. Чудо потом распухло и мешало ходить..."
	jokesMap[7] = "Штирлицу попала в голову пуля. \"Разрывная,\" - раскинул мозгами Штирлиц."
	jokesMap[8] = "Штирлиц стоял на своем. Это была любимая пытка Мюллера."
	jokesMap[9] = "Штирлиц настаивал на своем. Настойка получалась крепкой, но слегка мутноватой."
	return jokesMap[rand.Intn(10)]
}

func filmGenres(genres string) string {
	genresFilmMap := make(map[string]string) 
	genresFilmMap["Аниме"] = "Унесенные призраками, Ходячий замок, Твое имя, Мой сосед Тоторо, Мальчик и птица"
	genresFilmMap["Биографии"] = "Зеленая книга, Ford против Ferrari, Игры разума, Игра в имитацию, По соображениям совести"
	genresFilmMap["Боевики"] = "Гнев человеческий, Брат 2, Переводчик, Пчеловод"
	genresFilmMap["Военные"] = "В бой идут одни «старики», 9 рота, Небо"
	return genresFilmMap[genres]
}

func main(){
	fmt.Println("Вас приветствует Хаккобот, какую рекомендацию хотите? (введите номер)\n",
	"1. Фильмы по жанру\n",
	"2. Фильмы по настроению\n",
	"3. Музыка по жанру\n",
	"4. Музыка по настроению\n",
	"5. Рассказать анекдот\n",
	"6. Вывести каталог мерча\n",
	"7. Предоставить интерфейс покупки мерча")

	var variants string
	for{
		fmt.Scanln(&variants)
		switch variants {
		case "1":
			//fmt.Println("Введите жанр")
			//var vartemp = fmt.Scanln()
			//filmGenres(vartemp)
		case "2":

		case "3":

		case "4":

		case "5":
			fmt.Println(jokes())
			continue
		case "6":

		case "7":

		default:
			fmt.Println("Цифру")
		}
	}
	
}
